app/controllers/school_classes_controller.rb

  def show
    @schoolclass = SchoolClass.find_by(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE (edit) LIMIT ?  [["LIMIT", 1]]

  def create
    @schoolclass = SchoolClass.new(school_class_params)
    @schoolclass.save
    redirect_to SchoolClass.last
---
INSERT INTO "school_classes" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-02-27 17:15:51.031116"], ["updated_at", "2020-02-27 17:15:51.031116"]]
SELECT  "school_classes".* FROM "school_classes" ORDER BY "school_classes"."id" DESC LIMIT ?  [["LIMIT", 1]]

  def edit
    @schoolclass = SchoolClass.find_by(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE (2) LIMIT ?  [["LIMIT", 1]]

  def update
    @schoolclass = SchoolClass.find_by(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE (1) LIMIT ?  [["LIMIT", 1]]