app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)
    @student.save

    redirect_to Student.last
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bob"], ["last_name", "Roberts"], ["created_at", "2020-02-27 18:11:30.130724"], ["updated_at", "2020-02-27 18:11:30.130724"]]
SELECT  "students".* FROM "students" ORDER BY "students"."id" DESC LIMIT ?  [["LIMIT", 1]]